Revit 2026 API

# SketchEditScopeIsSketchEditingSupportedForSketchBasedElement Method

---

Checks whether the element supports sketch editing.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSketchEditingSupportedForSketchBasedElement(
	ElementId elemId
)
```
```vb
Public Function IsSketchEditingSupportedForSketchBasedElement (
	elemId As ElementId
) As Boolean
```
```cpp
public:
bool IsSketchEditingSupportedForSketchBasedElement(
	ElementId^ elemId
)
```
```fsharp
member IsSketchEditingSupportedForSketchBasedElement :
        elemId : ElementId -> bool
```

#### Parameters

elemId ElementId
     The element id to be checked.

#### Return Value

Boolean True if element supports sketch editing, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method checks if the element supports edit to all its sketches. If you want to check if this element supports edit to a particular sketch please use IsSketchEditingSupported(ElementId).

#### Reference

SketchEditScope Class

Autodesk.Revit.DB Namespace